q
Quit FVT_USB test
src/main.c:489: mem_stat -- malloc: 0, memalign: 52, calloc: 2, realloc: 0, free: 52, mem_leak: 8000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : lpddr
ddr_var_init
device: lpddr test case

Available commands
------------------
help  : Display list of commands
h  : alias for help
?  : alias for help
rconfig  : read lpddr config
memdump  : read mem dump in address range
readb  : read 1 byte from lpddr mem
writeb  : write 1 byte to lpddr mem
writebc  : Continuous 1 byte write/read back
scana  : scan byte test in address range
scanl  : scan byte test for mem Length
scanlw  : scan byte test for mem Length with wait
randl  : random u32 r/w test for mem Length
randa  : random u32 r/w test in address range
march_c  : march_C u32 test in address range
march_cf  : march_C u32 full free memory test
exceptionTst  : trigger exception
q  : quit lpddr access

cmd:> fvt_addrline
Bad command!

cmd:> q
Quit lpddr test
src/main.c:489: mem_stat -- malloc: 0, memalign: 52, calloc: 2, realloc: 0, free: 52, mem_leak: 8000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : lpddr
ddr_var_init
device: lpddr test case

Available commands
------------------
help  : Display list of commands
h  : alias for help
?  : alias for help
rconfig  : read lpddr config
memdump  : read mem dump in address range
readb  : read 1 byte from lpddr mem
writeb  : write 1 byte to lpddr mem
writebc  : Continuous 1 byte write/read back
scana  : scan byte test in address range
scanl  : scan byte test for mem Length
scanlw  : scan byte test for mem Length with wait
randl  : random u32 r/w test for mem Length
randa  : random u32 r/w test in address range
march_c  : march_C u32 test in address range
march_cf  : march_C u32 full free memory test
exceptionTst  : trigger exception
q  : quit lpddr access

cmd:> fvt_dataline
Bad command!

cmd:> q
Quit lpddr test
src/main.c:489: mem_stat -- malloc: 0, memalign: 52, calloc: 2, realloc: 0, free: 52, mem_leak: 8000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : nandflash
device: nandflash test case

Available commands
------------------
help              : Display list of commands
h                 : alias for help
?                 : alias for help
nand_mem_mode_set : mem mode select
nand_onfi_dump    : param page dump
nand_read_status  : execute ReadStatus or ReadEnhStatus op [1/2]
set_timing_md_feat: set timing mode feature [0..5]
nand_probe        : nand probe test
nand_erase        : nand erase block test
nand_erase_or_mark: nand erase or mark as bb block
nand_write        : nand write/read test
nand_1wmr         : nand write 1 and read more test
nand_read         : nand read test
nand_ecc          : nand ecc support test
nand_int          : nand interrupt test
nand_erase_all_or_mark    : nand erase all or mark as bb block(s)
nand_erase_all    : nand erase all blocks test
nand_scan_bbt     : scan bbt
nand_scan_bbt_range	  : scan bbt in block range
nand_check_partitions	  : check whole chip for allowed bb# in each partition
nand_mark_bb      : mark bad block
nand_check_bb	  : check block's status
nand_write_bbt    : write bbt to flash
nand_read_bbt     : read bbt from flash
q                 : quit nand test

cmd:> nand_probe 0 MT29F4G16ABBDA3W
nand_probe,1

cmd:> q
Quit nandflash test
src/main.c:489: mem_stat -- malloc: 0, memalign: 52, calloc: 2, realloc: 0, free: 52, mem_leak: 8000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : nandflash
device: nandflash test case

Available commands
------------------
help              : Display list of commands
h                 : alias for help
?                 : alias for help
nand_mem_mode_set : mem mode select
nand_onfi_dump    : param page dump
nand_read_status  : execute ReadStatus or ReadEnhStatus op [1/2]
set_timing_md_feat: set timing mode feature [0..5]
nand_probe        : nand probe test
nand_erase        : nand erase block test
nand_erase_or_mark: nand erase or mark as bb block
nand_write        : nand write/read test
nand_1wmr         : nand write 1 and read more test
nand_read         : nand read test
nand_ecc          : nand ecc support test
nand_int          : nand interrupt test
nand_erase_all_or_mark    : nand erase all or mark as bb block(s)
nand_erase_all    : nand erase all blocks test
nand_scan_bbt     : scan bbt
nand_scan_bbt_range	  : scan bbt in block range
nand_check_partitions	  : check whole chip for allowed bb# in each partition
nand_mark_bb      : mark bad block
nand_check_bb	  : check block's status
nand_write_bbt    : write bbt to flash
nand_read_bbt     : read bbt from flash
q                 : quit nand test

cmd:> nand_scan_bbt 0 MT29F4G16ABBDA3W
 ffb,BBTotal: 1,nand_scan_bbt,1

cmd:> q
Quit nandflash test
src/main.c:489: mem_stat -- malloc: 0, memalign: 52, calloc: 2, realloc: 0, free: 52, mem_leak: 8000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : nandflash
device: nandflash test case

Available commands
------------------
help              : Display list of commands
h                 : alias for help
?                 : alias for help
nand_mem_mode_set : mem mode select
nand_onfi_dump    : param page dump
nand_read_status  : execute ReadStatus or ReadEnhStatus op [1/2]
set_timing_md_feat: set timing mode feature [0..5]
nand_probe        : nand probe test
nand_erase        : nand erase block test
nand_erase_or_mark: nand erase or mark as bb block
nand_write        : nand write/read test
nand_1wmr         : nand write 1 and read more test
nand_read         : nand read test
nand_ecc          : nand ecc support test
nand_int          : nand interrupt test
nand_erase_all_or_mark    : nand erase all or mark as bb block(s)
nand_erase_all    : nand erase all blocks test
nand_scan_bbt     : scan bbt
nand_scan_bbt_range	  : scan bbt in block range
nand_check_partitions	  : check whole chip for allowed bb# in each partition
nand_mark_bb      : mark bad block
nand_check_bb	  : check block's status
nand_write_bbt    : write bbt to flash
nand_read_bbt     : read bbt from flash
q                 : quit nand test

cmd:> nand_check_partitions 0 MT29F4G16ABBDA3W
nand_check_partitions,1

cmd:> q
Quit nandflash test
src/main.c:489: mem_stat -- malloc: 0, memalign: 52, calloc: 2, realloc: 0, free: 52, mem_leak: 8000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : FVT_USB
device: FVT_USB test case

Available commands
------------------
help : Display list of commands
h    : alias for help
?    : alias for help
USB_AUTO_TEST  : FVT USB AUTO Test

cmd:> USB_AUTO_TEST
musb_start: devctl 99 power: 70
musb_start: devctl 99 power: 70

USB_AUTO_TEST_RESULT=1,USB0_RESULT=1,USB1_RESULT=1
cmd:> q
Quit FVT_USB test
src/main.c:489: mem_stat -- malloc: 0, memalign: 104, calloc: 4, realloc: 0, free: 104, mem_leak: 16000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : i2c1
device: i2c1 test case

Available commands
------------------
help : Display list of commands
h    : alias for help
?    : alias for help
i2c_slave   : i2c slave mode test
i2c_master  : i2c master basic read/write test
i2c_master2  : a special test case, which is designed for i2c slave interrupt test
i2c_robust  : i2c master robust read/write test
i2c_real  : i2c master real peripheral test
i2c_int_master  : i2c interrupt handle test
i2c_int_slave  : i2c interrupt handle test
i2c_send  : i2c LCD debug test
i2c_lcd  : i2c LCD test
accel_get_id : accelerometer get ID test
accel_read_raw_xyz : accelerometer read raw XYZ
accel_check_xyz : accelerometer check XYZ
accel_int : accelerometer interrupt set/clear

cmd:> i2c_slave 0x46 7b
I2C_SET_SLAVE_RESULT,1

cmd:> q
Quit i2c1 test
src/main.c:489: mem_stat -- malloc: 0, memalign: 104, calloc: 4, realloc: 0, free: 104, mem_leak: 16000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : i2c2
device: i2c2 test case

Available commands
------------------
help : Display list of commands
h    : alias for help
?    : alias for help
i2c_slave   : i2c slave mode test
i2c_master  : i2c master basic read/write test
i2c_master2  : a special test case, which is designed for i2c slave interrupt test
i2c_robust  : i2c master robust read/write test
i2c_real  : i2c master real peripheral test
i2c_int_master  : i2c interrupt handle test
i2c_int_slave  : i2c interrupt handle test
i2c_send  : i2c LCD debug test
i2c_lcd  : i2c LCD test
accel_get_id : accelerometer get ID test
accel_read_raw_xyz : accelerometer read raw XYZ
accel_check_xyz : accelerometer check XYZ
accel_int : accelerometer interrupt set/clear

cmd:> i2c_master 0 100000 0x46 7b 1024 0xa1
I2C_MASTER_TEST_RESULT,0

cmd:> q
Quit i2c2 test
src/main.c:489: mem_stat -- malloc: 0, memalign: 104, calloc: 4, realloc: 0, free: 104, mem_leak: 16000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : i2c0
device: i2c0 test case

Available commands
------------------
help : Display list of commands
h    : alias for help
?    : alias for help
i2c_slave   : i2c slave mode test
i2c_master  : i2c master basic read/write test
i2c_master2  : a special test case, which is designed for i2c slave interrupt test
i2c_robust  : i2c master robust read/write test
i2c_real  : i2c master real peripheral test
i2c_int_master  : i2c interrupt handle test
i2c_int_slave  : i2c interrupt handle test
i2c_send  : i2c LCD debug test
i2c_lcd  : i2c LCD test
accel_get_id : accelerometer get ID test
accel_read_raw_xyz : accelerometer read raw XYZ
accel_check_xyz : accelerometer check XYZ
accel_int : accelerometer interrupt set/clear

cmd:> i2c_slave 0x45 7b
I2C_SET_SLAVE_RESULT,1

cmd:> q
Quit i2c0 test
src/main.c:489: mem_stat -- malloc: 0, memalign: 104, calloc: 4, realloc: 0, free: 104, mem_leak: 16000


VERSION: 1.3.14
ARM CDL V2018.07.09 ITRON C2+: Jul  9 2018
Columbus FVT test,please select device first
0: timer  
1: watch dog timer  
2: rtc  
3: dmac0  
4: dmac1  
5: dmac2  
6: gpio  
7: uart0  
8: uart1  
9: uart2  
10: uart3  
11: i2c0  
12: i2c1  
13: i2c2  
14: spi0(qspi)  
15: spi1  
16: spi2  
17: mmc/sdio 0  
18: mmc/sdio 1  
19: nandflash  
20: usb0  
21: usb1  
22: otp  
23: crc  
24: adc  
25: ecc  
26: dwc_trng  
27: aes  
28: sha  
29: ipc  
30: epf  
31: tamper  
32: bburam  
33: api  
34: pll  
35: ddr  
36: sys  
37: system  
38: ipm2  
39: lpddr  
40: spi_sf  
41: FVT_USB  

Select the device to test : i2c2
device: i2c2 test case

Available commands
------------------
help : Display list of commands
h    : alias for help
?    : alias for help
i2c_slave   : i2c slave mode test
i2c_master  : i2c master basic read/write test
i2c_master2  : a special test case, which is designed for i2c slave interrupt test
i2c_robust  : i2c master robust read/write test
i2c_real  : i2c master real peripheral test
i2c_int_master  : i2c interrupt handle test
i2c_int_slave  : i2c interrupt handle test
i2c_send  : i2c LCD debug test
i2c_lcd  : i2c LCD test
accel_get_id : accelerometer get ID test
accel_read_raw_xyz : accelerometer read raw XYZ
accel_check_xyz : accelerometer check XYZ
accel_int : accelerometer interrupt set/clear

cmd:> i2c_master 0 100000